type ChartPoint = {
  x: string;
  y: number;
};

type ChartData = ChartPoint[];

//Фиксированные данные для графиков
export const chartDataByIndicator: Record<string, ChartData> = {
  "Выручка, руб": [
    { x: "Пн", y: 420_000 },
    { x: "Вт", y: 450_000 },
    { x: "Ср", y: 510_000 },
    { x: "Чт", y: 480_000 },
    { x: "Пт", y: 520_000 },
    { x: "Сб", y: 490_000 },
    { x: "Вс", y: 500_521 },
  ],

  "Наличные": [
    { x: "Пн", y: 280_000 },
    { x: "Вт", y: 295_000 },
    { x: "Ср", y: 310_000 },
    { x: "Чт", y: 305_000 },
    { x: "Пт", y: 320_000 },
    { x: "Сб", y: 300_000 },
    { x: "Вс", y: 300_000 },
  ],

  "Безналичный расчет": [
    { x: "Пн", y: 90_000 },
    { x: "Вт", y: 95_000 },
    { x: "Ср", y: 110_000 },
    { x: "Чт", y: 100_000 },
    { x: "Пт", y: 105_000 },
    { x: "Сб", y: 98_000 },
    { x: "Вс", y: 100_000 },
  ],

  "Кредитные карты": [
    { x: "Пн", y: 50_000 },
    { x: "Вт", y: 60_000 },
    { x: "Ср", y: 90_000 },
    { x: "Чт", y: 75_000 },
    { x: "Пт", y: 95_000 },
    { x: "Сб", y: 92_000 },
    { x: "Вс", y: 100_521 },
  ],

  "Средний чек, руб": [
    { x: "Пн", y: 1250 },
    { x: "Вт", y: 1300 },
    { x: "Ср", y: 1400 },
    { x: "Чт", y: 1350 },
    { x: "Пт", y: 1450 },
    { x: "Сб", y: 1320 },
    { x: "Вс", y: 1300 },
  ],

  "Средний гость, руб": [
    { x: "Пн", y: 1250 },
    { x: "Вт", y: 1110 },
    { x: "Ср", y: 820 },
    { x: "Чт", y: 1300 },
    { x: "Пт", y: 900 },
    { x: "Сб", y: 1320 },
    { x: "Вс", y: 1250 },
  ],

  "Удаление из чека (после оплаты), руб": [
    { x: "Пн", y: 1250 },
    { x: "Вт", y: 1150 },
    { x: "Ср", y: 1200 },
    { x: "Чт", y: 920 },
    { x: "Пт", y: 1250 },
    { x: "Сб", y: 1300 },
    { x: "Вс", y: 850 },
  ],

  "Удаление из чека (до оплаты), руб": [
    { x: "Пн", y: 1250 },
    { x: "Вт", y: 1100 },
    { x: "Ср", y: 1250 },
    { x: "Чт", y: 900 },
    { x: "Пт", y: 1000 },
    { x: "Сб", y: 920 },
    { x: "Вс", y: 1300 },
  ],

  "Количество чеков": [
    { x: "Пн", y: 28 },
    { x: "Вт", y: 33 },
    { x: "Ср", y: 36 },
    { x: "Чт", y: 34 },
    { x: "Пт", y: 39 },
    { x: "Сб", y: 37 },
    { x: "Вс", y: 30 },
  ],

  "Количество гостей": [
    { x: "Пн", y: 34 },
    { x: "Вт", y: 38 },
    { x: "Ср", y: 36 },
    { x: "Чт", y: 34 },
    { x: "Пт", y: 43 },
    { x: "Сб", y: 29 },
    { x: "Вс", y: 27 },
  ],
};